#### OpenTofu Validation 🤖`success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.data.module.onepassword.data.onepassword_vault.swag_lgbt: Reading...
module.data.module.onepassword.data.onepassword_vault.swag_lgbt: Read complete after 0s [id=vaults/syp4svuf7qzbcuu5umljoo4bb4]
module.data.module.onepassword.data.onepassword_item.cloudflare_api_token: Reading...
module.data.module.onepassword.data.onepassword_item.onepassword_service_account_token: Reading...
module.data.module.onepassword.data.onepassword_item.digitalocean_access_token: Reading...
module.data.module.onepassword.data.onepassword_item.onepassword_service_account_token: Read complete after 1s [id=vaults/syp4svuf7qzbcuu5umljoo4bb4/items/oj6efv7u5w6so5a35icnca7lae]
module.data.module.onepassword.data.onepassword_item.digitalocean_access_token: Read complete after 1s [id=vaults/syp4svuf7qzbcuu5umljoo4bb4/items/v5un5i5yzxapu2r3j5t6llivqu]
module.data.module.onepassword.data.onepassword_item.cloudflare_api_token: Read complete after 1s [id=vaults/syp4svuf7qzbcuu5umljoo4bb4/items/olodum4evqjyj2znrkx62tuwve]
module.apps.module.passport.data.onepassword_item.stytch_api_subdomain: Reading...
module.data.module.cloudflare.data.cloudflare_zone.swag_lgbt: Reading...
module.apps.module.passport.data.onepassword_item.stytch_api_subdomain: Read complete after 0s [id=vaults/syp4svuf7qzbcuu5umljoo4bb4/items/txtiult7ny4zu2vpm76t43okjq]
module.data.module.cloudflare.data.cloudflare_zone.swag_lgbt: Read complete after 0s [id=243f037e4db09925df6e0c04681b4971]
module.apps.module.passport.cloudflare_record.stytch: Refreshing state... [id=d579b5b7fbfa7fc02686e46b35f5c0e1]
module.apps.module.passport.cloudflare_pages_project.passport: Refreshing state... [id=swag-lgbt-passport]
module.apps.module.passport.cloudflare_pages_domain.passport: Refreshing state... [id=b92a7871-f768-4f03-8231-1beffdddbe99]
module.apps.module.passport.cloudflare_record.passport: Refreshing state... [id=cfc6f91b6566200a63da4e967e4a7f65]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # module.apps.module.passport.cloudflare_pages_domain.passport must be replaced
-/+ resource "cloudflare_pages_domain" "passport" {
      ~ domain       = "account.swag.lgbt" -> "passport.swag.lgbt" # forces replacement
      ~ id           = "b92a7871-f768-4f03-8231-1beffdddbe99" -> (known after apply)
      ~ status       = "active" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.apps.module.passport.cloudflare_pages_project.passport will be updated in-place
  ~ resource "cloudflare_pages_project" "passport" {
        id                = "swag-lgbt-passport"
        name              = "swag-lgbt-passport"
        # (5 unchanged attributes hidden)

      ~ build_config {
          ~ build_command   = "pnpm pages:build" -> "pnpm build"
          ~ destination_dir = ".vercel/output/static" -> "dist"
            # (2 unchanged attributes hidden)
        }

      ~ deployment_configs {
          ~ preview {
              ~ environment_variables                = {
                  + "OAUTH_REDIRECT_API" = "https://test.stytch.com/v1/oauth/callback/oauth-callback-test-2b5d454f-e05d-498d-9d10-4abeb5a50591"
                }
              ~ usage_model                          = "standard" -> "bundled"
                # (9 unchanged attributes hidden)
            }
          ~ production {
              ~ environment_variables                = {
                  + "OAUTH_REDIRECT_API" = "https://api.stytch.swag.lgbt/v1/oauth/callback/oauth-callback-live-c24db04e-7018-4646-b66e-9bdce7194b32"
                }
              ~ usage_model                          = "standard" -> "bundled"
                # (9 unchanged attributes hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # module.apps.module.passport.cloudflare_record.passport must be replaced
-/+ resource "cloudflare_record" "passport" {
      ~ created_on      = "2024-05-23T14:04:36.517382Z" -> (known after apply)
      ~ hostname        = "account.swag.lgbt" -> (known after apply)
      ~ id              = "cfc6f91b6566200a63da4e967e4a7f65" -> (known after apply)
      ~ metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> (known after apply)
      ~ modified_on     = "2024-05-23T14:04:36.517382Z" -> (known after apply)
      ~ name            = "account" -> "passport" # forces replacement
      ~ proxiable       = true -> (known after apply)
      - tags            = [] -> null
        # (6 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/home/runner/work/swagLGBT/swagLGBT/tofu-plan-lint-qwik-9259895471

To perform exactly these actions, run the following command to apply:
    tofu apply "/home/runner/work/swagLGBT/swagLGBT/tofu-plan-lint-qwik-9259895471"

```

</details>